Public Member Functions | List of all members
ACAPI::Library::GSMObject::Modifier Class Referencefinal
Library Management
The modifier object of the GSMObject. More...
#include <GSMObject.hpp>
 Inheritance diagram for ACAPI::Library::GSMObject::Modifier:
 Public Member Functions
ACAPI::Result< void >  | SetPlaceable (bool placeable)
Sets the placeable flag of the object. If true, the object can be placed in a plan file.
ACAPI::Result< void >  | SetPassword (const GS::UniString &newPassword)
Sets the password of the object. If a password is set, it will encrypt and lock the object.
ACAPI::Result< void >  | SetIsSubtype (bool isSubType)
Sets the object as a subtype.
ACAPI::Result< void >  | SetAuthor (const GS::UniString &author)
Sets the author of the object.
ACAPI::Result< void >  | SetLicense (const GS::UniString &license)
Sets the license code of the object.
ACAPI::Result< void >  | SetLicenseVersion (const GS::UniString &licVer)
Sets the license version of the object.
ACAPI::Result< void >  | SetDescription (const GS::UniString &description)
Sets the description of the object.
ACAPI::Result< void >  | SetKeywords (const GS::UniString &keywords)
Sets the keywords of the object. That is used by several search tools. Usually it is a comma separated list.
ACAPI::Result< void >  | SetParameters (const GDL::Parameters &newParamList, const std::vector< GS::UniString > &descriptions)
Sets the parameters of the object. This function will replace the entire parameter list.
ACAPI::Result< void >  | MergeParameters (const GDL::Parameters &newParamList, const std::vector< GS::UniString > &descriptions)
Merges new parameters to the object. This function will add new parameters and replace the existing ones.
ACAPI::Result< void >  | SetMasterScript (const GS::UniString &script)
Sets the master script. This function will replace the existing master script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | Set2DScript (const GS::UniString &script)
Sets the 2D script. This function will replace the existing 2D script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | Set3DScript (const GS::UniString &script)
Sets the 3D script. This function will replace the existing 3D script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | SetPropertiesScript (const GS::UniString &script)
Sets the properties script. This function will replace the existing properties script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | SetParameterScript (const GS::UniString &script)
Sets the parameter script. This function will replace the existing parameter script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | SetInterfaceScript (const GS::UniString &script)
Sets the interface script. This function will replace the existing interface script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | SetUIDefault (bool isDefault)
Sets the interface as default.
ACAPI::Result< void >  | SetHierarchicalPagesUsed (bool hierarchicalPagesUsed)
Sets the interface uses hierarchical pages.
ACAPI::Result< void >  | SetForwardMigrationScript (const GS::UniString &script)
Sets the forward migration script. This function will replace the existing forward migration script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | SetBackwardMigrationScript (const GS::UniString &script)
Sets the backward migration script. This function will replace the existing backward migration script. If it is empty, the script will NOT be deleted but set to empty.
ACAPI::Result< void >  | Set2DVectorImage (const VectorImage &image)
Sets a vector image as 2D symbol. This function will replace the existing 2D symbol. If it is empty, the symbol will NOT be deleted but set to empty.
ACAPI::Result< void >  | SetPreviewPicture (const GX::ImageRef &image)
Sets the preview picture.
ACAPI::Result< void >  | SetDarkPreviewPicture (const GX::ImageRef &image)
Sets the dark mode preview picture.
ACAPI::Result< void >  | SetGDLPictures (const std::vector< GX::ImageRef > &images)
Sets the pictures which are referred from th GDL scripts.
ACAPI::Result< void >  | SetDarkGDLPictures (const std::vector< GX::ImageRef > &images)
Sets the dark mode pictures which are referred from th GDL scripts.
ACAPI::Result< void >  | SetCustomSection (uint32_t sectionTypeID, uint16_t index, const GSMSectionData &data)
Sets a custom section.
ACAPI::Result< void >  | DeleteMasterScript ()
Deletes the master script.
ACAPI::Result< void >  | Delete2DScript ()
Deletes the 2D script.
ACAPI::Result< void >  | Delete3DScript ()
Deletes the 3D script.
ACAPI::Result< void >  | DeletePropertiesScript ()
Deletes the properties script.
ACAPI::Result< void >  | DeleteParameterScript ()
Deletes the parameter script.
ACAPI::Result< void >  | DeleteInterfaceScript ()
Deletes the interface script.
ACAPI::Result< void >  | DeleteForwardMigrationScript ()
Deletes the forward migration script.
ACAPI::Result< void >  | DeleteBackwardMigrationScript ()
Deletes the backward migration script.
ACAPI::Result< void >  | Delete2DVectorImage ()
Deletes the 2D Vector image.
ACAPI::Result< void >  | DeletePreviewPicture ()
Deletes the preview picture.
ACAPI::Result< void >  | DeleteDarkPreviewPicture ()
Deletes the dark mode preview picture.
ACAPI::Result< void >  | DeleteGDLPictures ()
Deletes GDL pictures.
ACAPI::Result< void >  | DeleteDarkGDLPictures ()
Deletes dark mode GDL pictures.
ACAPI::Result< void >  | DeleteCustomSection (uint32_t sectionID, uint16_t index=0)
Deletes a custom section.
Detailed Description
The modifier object of the GSMObject.